The selected fitting(s) cannot successfully change the type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationPartCannotChangeTypeUnConnError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeUnConnError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace